

f: {
 ; d1: d pj/ {([k: enlist x] v: enlist 1)} each raze -1_ "-" vs x
 ; common : 5 # raze exec k from `v xdesc select asc k by v from d1 where v <> 0 
 ; ck: -1 _ last "[" vs x
 ; $[common ~ ck; "I"$ first "[" vs last "-" vs x ; 0]
 } 

f x: "aaaaa-bbb-z-y-x-123[abxyz]"
f "a-b-c-d-e-f-g-h-987[abcde]"
f "not-a-real-room-404[oarel]"
f "totally-real-room-200[decoy]"
sum f each t

src_q{"-" vs x} ="aaaaa"
"bbb"
,"z"
,"y"
,"x"
"123[abxyz]"
=

#+begin_src q 
  d:([]k: .Q.a; v: 26#0)
  d
#+end_src

#+RESULTS:
#+begin_example
k v
---
a 0
b 0
c 0
d 0
e 0
f 0
g 0
h 0
i 0
j 0
k 0
l 0
m 0
n 0
o 0
p 0
q 0
r 0
s 0
t 0
..
#+end_example

First, define an auxilary function that for each character of x, generate a dictionary
#+begin_src q
ele: {([k: enlist x] v: enlist 1)}
#+end_src

#+RESULTS:
: 1 2 3
: `s#1 2 3

Let's define a function with example argument in the first row of below table. 
 | "aaaaa-bbb-z-y-x-115[abxyz]" |                                                                                 |
 | "-" vs                       | ("aaaaa";"bbb";,"z";,"y";,"x";"115[abxyz]")                                     |
 | -1 _                         | ("aaaaa";"bbb";,"z";,"y";,"x")                                                  |
 | raze                         | "aaaaabbbzyx"                                                                   |
 | ele each                     | ((+(,`k)!,,"a")!+(,`v)!,,1;(+(,`k)!,,"a")!+(,`v)!,,1;(+(,`k)!,,"a")!+(,`v)!,,.. |
 | ([]k: .Q.a; v: 26#0) pj/     | +`k`v!("abcdefghijklmnopqrstuvwxyz";5 3 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.. |
 | ![; enlist(=;`v;0); 0b; 0#`] | +`k`v!("abxyz";5 3 1 1 1)                                                       |
 | select asc k by v from       | (`s#+(,`v)!,`s#1 3 5)!+(,`k)!,(`s#"xyz";`s#,"b";`s#,"a")                        |
 | `v xdesc                     | (+(,`v)!,5 3 1)!+(,`k)!,(`s#,"a";`s#,"b";`s#"xyz")                              |
 | exec k from                  | (`s#,"a";`s#,"b";`s#"xyz")                                                      |
 | raze                         | "abxyz"                                                                         |
 | 5 #                          | "abxyz"                                                                         |
#+TBLFM: $2='(qq(step @# $-1))

#+begin_src q 
  \c 5 200
  t: read0 `:4.txt
  t
#+end_src

#+RESULTS:
: "nzydfxpc-rclop-qwzhpc-qtylyntyr-769[oshgk]"
: "qzlozfhmf-bzmcx-bnzshmf-zbpthrhshnm-339[zmxdi]"
: "xtwtelcj-rclop-upwwjmply-zapcletzyd-743[itbds]"
: "mrxivrexmsrep-fewoix-ywiv-xiwxmrk-308[kzypw]"
: "ibghopzs-qobrm-difqvogwbu-142[lnrzo]"
: "irgyyolokj-xghhoz-lotgtiotm-228[vnmxd]"
: "foadouwbu-gqojsbusf-vibh-fsgsofqv-376[ymswi]"
: ..

